MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_07_20_01/System.cpp
        baseLat = kDefaultTestBaseLat;
        baseLon = kDefaultTestBaseLon;
    }

    static void refreshOwnshipTimestamp()
    {
        ThisAircraft.timestamp = currentSystemSeconds();
    }

    static void applyOwnshipIdentity(uint8_t mode)
    {
        if (FlyRfMode_usesLocalCoordinates(mode))
        {
            ThisAircraft.squawk = 1110;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "TEST001");
            ThisAircraft.aircraft_type = AIRCRAFT_TYPE_JET;
        }
        else
        {
            ThisAircraft.squawk = 1111;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "FlyRF");
            ThisAircraft.aircraft_type = settings ? settings->aircraft_type : AIRCRAFT_TYPE_UNKNOWN;
        }
    }

    static bool advanceMotionStep(uint32_t nowMs, uint32_t& lastStepMs, int16_t& offsetSteps, int8_t& direction)
    {
        bool changed = false;
        while ((uint32_t)(nowMs - lastStepMs) >= kMotionStepPeriodMs)
        {
            lastStepMs += kMotionStepPeriodMs;
            offsetSteps = (int16_t)(offsetSteps + direction);
            if (offsetSteps >= kTestTrackLimitSteps)
            {
                offsetSteps = kTestTrackLimitSteps;
                direction = -1;
            }
            else if (offsetSteps <= -kTestTrackLimitSteps)
            {
                offsetSteps = -kTestTrackLimitSteps;
                direction = 1;
            }
            changed = true;
        }
        return changed;
    }

    static void computeTrackPosition(float baseLat, float baseLon, float forwardCourseDeg,
                                     int16_t offsetSteps, int8_t direction,
                                     float& outLat, float& outLon, float& outCourse, float& outSpeed)
    {
        const float reverseCourseDeg = normalizeCourse360(forwardCourseDeg + 180.0f);
        const float legBearing = (offsetSteps >= 0) ? forwardCourseDeg : reverseCourseDeg;
        const double distanceMeters = fabs((double)offsetSteps) * (double)kTestTrackStepMeters;
        projectCoordinate((double)baseLat, (double)baseLon, legBearing, distanceMeters, outLat, outLon);
        outCourse = (direction >= 0) ? forwardCourseDeg : reverseCourseDeg;
        outSpeed = kTestTrackSpeedKnots;
    }

    static void computeSimulatedAltitude(uint32_t nowMs, size_t profileIndex,
                                         float& outAltitude, float& outPressureAltitude,
                                         int& outVertRate, float& outVs)
    {
        const float altitudeRange = kSimAltitudeMaxMeters - kSimAltitudeMinMeters;
        if (altitudeRange <= 0.0f || kSimAltitudeHalfPeriodMs == 0UL || kSimAltitudeFullPeriodMs == 0UL)
        {
            outAltitude = kSimAltitudeMinMeters;
            outPressureAltitude = kSimAltitudeMinMeters;
            outVertRate = 0;
            outVs = 0.0f;
            return;
        }

        const size_t normalizedProfile = (kSimAltitudeProfileCount > 0U) ? (profileIndex % kSimAltitudeProfileCount) : 0U;
        const uint32_t phaseMs = (uint32_t)(((uint64_t)normalizedProfile * (uint64_t)kSimAltitudeFullPeriodMs) /
                                            (uint64_t)kSimAltitudeProfileCount);
        const uint32_t cycleMs = (nowMs + phaseMs) % kSimAltitudeFullPeriodMs;
        const bool climbing = cycleMs < kSimAltitudeHalfPeriodMs;
        const float fraction = climbing ? ((float)cycleMs / (float)kSimAltitudeHalfPeriodMs)
                                        : ((float)(cycleMs - kSimAltitudeHalfPeriodMs) / (float)kSimAltitudeHalfPeriodMs);

        outAltitude = climbing ? (kSimAltitudeMinMeters + altitudeRange * fraction)
                               : (kSimAltitudeMaxMeters - altitudeRange * fraction);
        outPressureAltitude = outAltitude;

        const float verticalSpeedMps = altitudeRange / ((float)kSimAltitudeHalfPeriodMs / 1000.0f);
        const float signedVerticalSpeedMps = climbing ? verticalSpeedMps : -verticalSpeedMps;
        outVs = signedVerticalSpeedMps * (_GPS_FEET_PER_METER * 60.0f);
        outVertRate = (int)lroundf(outVs);
    }

    static void clearSimulatedTrafficEntries()
    {
        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            for (int j = 0; j < MAX_TRACKING_OBJECTS; ++j)
            {
                if (Container[j].addr == kSimTrafficAddresses[i])
                {
                    Container[j] = EmptyFO;
                }
            }
        }
    }

    static void resetTestFlightState(float baseLat, float baseLon, uint8_t mode)
    {
        g_lastModeApplied = mode;
        g_lastModeBaseLat = baseLat;
        g_lastModeBaseLon = baseLon;
        g_testFlightOffsetSteps = 0;
        g_testFlightDirection = 1;
        g_lastTestFlightStepMs = millis();
        g_testTrafficEpochMs = g_lastTestFlightStepMs;
        g_testDisplayCourseDeg = 0U;
        g_lastTestDisplayCourseStepMs = g_lastTestFlightStepMs;
        clearSimulatedTrafficEntries();

        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            g_simTraffic[i].active = false;
            g_simTraffic[i].addr = kSimTrafficAddresses[i];
            g_simTraffic[i].squawk = kSimTrafficSquawks[i];
            fillCallsign(g_simTraffic[i].callsign, sizeof(g_simTraffic[i].callsign), kSimTrafficCallsigns[i]);
            g_simTraffic[i].latitude = baseLat;
            g_simTraffic[i].longitude = baseLon;
            g_simTraffic[i].offsetSteps = 1;
            g_simTraffic[i].direction = 1;
            g_simTraffic[i].lastStepMs = g_testTrafficEpochMs;
            g_simTraffic[i].startDelayMs = (mode == FLYRF_MODE_TXRX_TEST4) ? (uint32_t)(i * kSimTrafficAsyncDelayMs) : 0UL;
        }
    }

    static void serviceSimulatedTraffic(float baseLat, float baseLon, uint8_t mode)
    {
        const bool simulatedTrafficMode = (mode == FLYRF_MODE_TXRX_TEST3 ||
                                           mode == FLYRF_MODE_TXRX_TEST4);
        if (!simulatedTrafficMode)
        {
            if (g_simTrafficWasActive)
            {
                clearSimulatedTrafficEntries();
                g_simTrafficWasActive = false;
            }
            return;
        }

        g_simTrafficWasActive = true;
        const uint32_t nowMs = millis();
        const time_t nowTs = (time_t)(nowMs / 1000UL);

